CREATE DATABASE  IF NOT EXISTS `cargo_camp` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `cargo_camp`;
-- MySQL dump 10.13  Distrib 8.0.24, for Win64 (x86_64)
--
-- Host: localhost    Database: cargo_camp
-- ------------------------------------------------------
-- Server version	8.0.40

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Dumping data for table `category`
--

LOCK TABLES `category` WRITE;
/*!40000 ALTER TABLE `category` DISABLE KEYS */;
INSERT INTO `category` VALUES (1,'Грузоперевозки и доставка','2025-02-11 18:06:50','2025-02-11 18:06:50'),(2,'Строительство и ремонт','2025-02-11 18:06:50','2025-02-11 18:06:50'),(3,'Мелкий бытовой ремонт','2025-02-11 18:06:50','2025-02-11 18:06:50'),(4,'Астоуслуги','2025-02-11 18:06:50','2025-02-11 18:06:50'),(5,'Уборка и клининг','2025-02-11 18:06:50','2025-02-11 18:06:50'),(6,'Разнорабочие и помощь на стройке','2025-02-11 18:06:50','2025-02-11 18:06:50'),(7,'Специалисты с узкими навыками','2025-02-11 18:06:50','2025-02-11 18:06:50'),(8,'Электронные и IT-услуги','2025-02-11 18:06:50','2025-02-11 18:06:50'),(9,'Курьерские и вспомогательные услуги','2025-02-11 18:06:50','2025-02-11 18:06:50'),(11,'Другое','2025-02-13 11:30:38','2025-02-13 11:30:38');
/*!40000 ALTER TABLE `category` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `subcategory`
--

LOCK TABLES `subcategory` WRITE;
/*!40000 ALTER TABLE `subcategory` DISABLE KEYS */;
INSERT INTO `subcategory` VALUES (1,'Грузоперевозки',1,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(2,'Доставка товаров',1,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(3,'Перевозка пассажиров',1,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(4,'Переезды',1,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(5,'Вывоз мусора',1,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(6,'Аренда спецтехники (манипулятор, кран)',1,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(7,'Сантехник',2,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(8,'Электрик',2,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(9,'Плиточник',2,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(10,'Каменщик',2,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(11,'Сварщик',2,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(12,'Отделка и ремонт помещений',2,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(13,'Установка дверей и окон',2,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(14,'Плотник / Столяр',2,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(15,'Подсобные работы',2,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(16,'Бетонные работы (заливка фундамента, стяжка пола)',2,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(17,'Кровельные работы',2,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(18,'Ремонт фасадов и утепление зданий',2,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(19,'Земляные работы (копка ям, траншей)',2,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(20,'Благоустройство территории (тротуарная плитка, заборы)',2,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(21,'Сборка мебели',3,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(22,'Установка сантехники',3,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(23,'Установка карнизов, полок',3,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(24,'Ремонт бытовой техники',3,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(25,'Установка и ремонт кондиционеров',3,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(26,'Вскрытие замков',3,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(27,'Ремонт автомобилей',4,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(28,'Автоэлектрик',3,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(29,'Шиномонтаж',4,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(30,'Эвакуатор',4,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(31,'Полировка и покраска авто',4,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(32,'Замена масла и фильтров',4,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(33,'Ремонт ходовой части',4,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(34,'Установка автосигнализаций',4,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(35,'Тонировка и шумоизоляция',4,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(36,'Генеральная уборка',5,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(37,'Уборка офисов',5,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(38,'Химчистка мебели',5,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(39,'Уборка придомовой территории',5,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(40,'Мытье окон и фасадов',5,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(41,'Уборка после ремонта',5,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(42,'Грузчики',6,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(43,'Подсобники на стройке',6,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(44,'Сельхозработы',6,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(45,'Дворники',6,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(46,'Демонтаж конструкций',6,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(47,'Снос зданий',6,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(48,'Монтаж металлоконструкций',6,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(49,'Маляр',7,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(50,'Инженер-строитель',7,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(51,'Ландшафтный дизайнер',7,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(52,'Монтажник кондиционеров',7,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(53,'Фотограф / Видеограф',7,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(54,'Дизайнер интерьеров',7,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(55,'Геодезист (измерение участков)',7,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(56,'Оценщик недвижимости и авто',7,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(57,'Ремонт компьютеров и ноутбуков',8,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(58,'Ремонт телефонов',8,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(59,'Установка ПО и настройка техники',8,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(60,'Создание сайтов и разработка ПО',8,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(61,'Настройка Wi-Fi и видеонаблюдения',8,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(62,'Курьерская доставка',9,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(63,'Оформление документов (нотариус, юрист)',9,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(64,'Бухгалтерские услуги',9,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(65,'Колл-центр и обзвоны',9,'2025-02-11 18:12:27','2025-02-11 18:12:27'),(66,'Другое',11,'2025-02-17 20:57:21','2025-02-17 20:57:21');
/*!40000 ALTER TABLE `subcategory` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-03-02 17:10:23
